soap_test_customerservice.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://www.kiatnakinbank.com/services/CIS/CustomerService">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:RequestMessage>
         <!--Optional:-->
         <cus:Data>
            <!--Optional:-->
            <cus:AddressInfoList>
               <!--Zero or more repetitions:-->
               <cus:AddressInfo>
                  <!--Optional:-->
                  <cus:AddressNo>?</cus:AddressNo>
                  <!--Optional:-->
                  <cus:AddressType>02</cus:AddressType>
                  <!--Optional:-->
                  <cus:Building>?</cus:Building>
                  <!--Optional:-->
                  <cus:CountryCode>JP</cus:CountryCode>
                  <!--Optional:-->
                  <cus:DistrictCode>?</cus:DistrictCode>
                  <!--Optional:-->
                  <cus:Email>?</cus:Email>
                  <!--Optional:-->
                  <cus:FloorNo>?</cus:FloorNo>
                  <!--Optional:-->
                  <cus:Moo>?</cus:Moo>
                  <!--Optional:-->
                  <cus:PhoneInfoList>
                     <!--Zero or more repetitions:-->
                     <cus:PhoneInfo>
                        <!--Optional:-->
                        <cus:PhoneExt>?</cus:PhoneExt>
                        <!--Optional:-->
                        <cus:PhoneNo>?</cus:PhoneNo>
                        <!--Optional:-->
                        <cus:PhoneType>02</cus:PhoneType>
                     </cus:PhoneInfo>
                  </cus:PhoneInfoList>
                  <!--Optional:-->
                  <cus:PostalCode>?</cus:PostalCode>
                  <!--Optional:-->
                  <cus:ProvinceCode>?</cus:ProvinceCode>
                  <!--Optional:-->
                  <cus:Soi>?</cus:Soi>
                  <!--Optional:-->
                  <cus:Street>?</cus:Street>
                  <!--Optional:-->
                  <cus:SubDistrictCode>?</cus:SubDistrictCode>
                  <!--Optional:-->
                  <cus:Village>?</cus:Village>
               </cus:AddressInfo>
            </cus:AddressInfoList>
            <!--Optional:-->
            <cus:AuthorizedShareCapital>?</cus:AuthorizedShareCapital>
            <!--Optional:-->
            <cus:BranchVat>?</cus:BranchVat>
            <!--Optional:-->
            <cus:BusinessCode></cus:BusinessCode>
            <!--Optional:-->
            <cus:ContractNo></cus:ContractNo>
            <!--Optional:-->
            <cus:CustomerInfo>
               <!--Optional:-->
               <cus:Birthdate>?</cus:Birthdate>
               <!--Optional:-->
               <cus:CardID>?</cus:CardID>
               <!--Optional:-->
               <cus:EducationCode></cus:EducationCode>
               <!--Optional:-->
               <cus:FirstnameEN>?</cus:FirstnameEN>
               <!--Optional:-->
               <cus:FirstnameTH>?</cus:FirstnameTH>
               <!--Optional:-->
               <cus:Gender>M</cus:Gender>
               <!--Optional:-->
               <cus:Income></cus:Income>
               <!--Optional:-->
               <cus:LastnameEN>?</cus:LastnameEN>
               <!--Optional:-->
               <cus:LastnameTH>?</cus:LastnameTH>
               <!--Optional:-->
               <cus:MaritalStatus>01</cus:MaritalStatus>
               <!--Optional:-->
               <cus:MiddlenameEN>?</cus:MiddlenameEN>
               <!--Optional:-->
               <cus:MiddlenameTH>?</cus:MiddlenameTH>
               <!--Optional:-->
               <cus:NameEN>?</cus:NameEN>
               <!--Optional:-->
               <cus:NameTH>?</cus:NameTH>
               <!--Optional:-->
               <cus:NationalityCode>EG</cus:NationalityCode>
               <!--Optional:-->
               <cus:ReligionCode>?</cus:ReligionCode>
               <!--Optional:-->
               <cus:TitleEN>?</cus:TitleEN>
               <!--Optional:-->
               <cus:TitleTH>2</cus:TitleTH>
            </cus:CustomerInfo>
            <!--Optional:-->
            <cus:FixedAssetExcludeLand>?</cus:FixedAssetExcludeLand>
            <!--Optional:-->
            <cus:KKPCISID>1549176299</cus:KKPCISID>
            <!--Optional:-->
            <cus:NumberOfEmployee></cus:NumberOfEmployee>
            <!--Optional:-->
            <cus:RegistrationInfo>
               <!--Optional:-->
               <cus:CardIDExpiryDate>?</cus:CardIDExpiryDate>
               <!--Optional:-->
               <cus:CardIDIssuedDate>?</cus:CardIDIssuedDate>
               <!--Optional:-->
               <cus:CardTypeCode>I</cus:CardTypeCode>
               <!--Optional:-->
               <cus:CompanyName>?</cus:CompanyName>
               <!--Optional:-->
               <cus:CompanyTitle>?</cus:CompanyTitle>
               <!--Optional:-->
               <cus:CustTypeCode>18</cus:CustTypeCode>
               <!--Optional:-->
               <cus:CustTypeGroup>?</cus:CustTypeGroup>
               <!--Optional:-->
               <cus:IsicCode>C110110</cus:IsicCode>
               <!--Optional:-->
               <cus:OccupationCode>8</cus:OccupationCode>
               <!--Optional:-->
               <cus:TaxID>?</cus:TaxID>
            </cus:RegistrationInfo>
         </cus:Data>
         <!--Optional:-->
         <cus:Header>
            <!--Optional:-->
            <cus:Password>?</cus:Password>
            <!--Optional:-->
            <cus:ReferenceNo>?</cus:ReferenceNo>
            <!--Optional:-->
            <cus:ServiceName>?</cus:ServiceName>
            <!--Optional:-->
            <cus:SystemCode>?</cus:SystemCode>
            <!--Optional:-->
            <cus:TransactionDate>20160606121314</cus:TransactionDate>
            <!--Optional:-->
            <cus:Username>?</cus:Username>
         </cus:Header>
      </cus:RequestMessage>
   </soapenv:Body>
</soapenv:Envelope>